Дипломная/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Дипломная/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Дипломная/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаКлиенте
Процедура ЗаполнитьСписокДоговоров(Команда)
	
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокДоговоровНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоговоровНаСервере()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
                   |	РеализацияТоваровУслуг.Договор КАК Договор
                   |ИЗ
                   |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
                   |ГДЕ
                   |	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидАбонентскоеОбслуживание
                   |	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";

    Запрос.УстановитьПараметр("ВидАбонентскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
    Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания);
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Объект.Договоры.Очистить();

    Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Договоры.Добавить();
        НоваяСтрока.Договор = Выборка.Договор;
		НоваяСтрока.Реализация = Выборка.Реализация;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период!");
		Возврат;
	КонецЕсли;
	
	НачалоПериода = Объект.Период.ДатаНачала;
	КонецПериода   = Объект.Период.ДатаОкончания;
	
	Если НачалоПериода <> НачалоМесяца(НачалоПериода) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Начало периода должно быть первым числом месяца!");
		Возврат;
	КонецЕсли;
	
	Если КонецПериода <> КонецМесяца(КонецПериода) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Конец периода должен быть последним числом месяца!");
		Возврат;
	КонецЕсли;
	
	Если НачалоМесяца(КонецПериода) <> НачалоМесяца(НачалоПериода) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Можно выбрать только один календарный месяц!");
		Возврат;
	КонецЕсли;
	
	Объект.Договоры.Очистить();
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("Период", Объект.Период);
	
	ДлительнаяОперация = СоздатьРеализацииНаСервере(ПараметрыОперации);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
		
	ТекстСообщения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Результат тяжелой операции: %1", ТекстСообщения));
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОПрогрессе(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Прогресс <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выполняется алгоритм... "); 
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Функция СоздатьРеализацииНаСервере(ПараметрыОперации)	
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(Новый УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеРеализаций", ПараметрыОперации);
		
	Возврат ДлительнаяОперация;
		
КонецФункции

#КонецОбласти
